Repository: oussamamohamed/POS_SK
Catalog: ios/RestaurantPOS/Resources/Localizable.xcstrings
Source language: en
Languages: ar, fr

# order.discount_action
source: Discount
ar: خصم
fr: Remise

# order.discount_comp_option %lld %@ %@
source: Comp: %lld× %@ (⁦%@⁩)
ar: مجاني: %lld× %@ (⁦%@⁩)
fr: Offrir : %lld× %@ (⁦%@⁩)

# order.discount_global_option
source: Overall discount on the bill
ar: خصم شامل على الفاتورة
fr: Remise globale sur la note

# order.discount_reason_goodwill_gesture
source: Goodwill Gesture
ar: بادرة تجارية
fr: Geste commercial

# order.discount_reason_label
source: Reason
ar: السبب
fr: Motif

# order.discount_reason_long_wait
source: Extended Wait
ar: انتظار مطول
fr: Attente prolongée

# order.discount_reason_loyal_customer
source: Loyal Customer
ar: عميل مخلص
fr: Client fidèle

# order.discount_reason_other_motif
source: Other Reason
ar: سبب آخر
fr: Autre motif

# order.discount_reason_service_error
source: Service Error
ar: خطأ في الخدمة
fr: Erreur de service

# order.discount_reason_staff_meal
source: Staff Meal
ar: وجبة الموظفين
fr: Repas du personnel

# order.discount_row_label %@
source: Discount %@
ar: خصم %@
fr: Remise %@

# order.discount_sheet_title
source: Discount & comp
ar: خصم ومجاني
fr: Remise & gratuité

# order.discount_target_label
source: Target
ar: الهدف
fr: Cible

# order.discount_unit_label
source: Unit
ar: الوحدة
fr: Unité

# order.discount_value_placeholder
source: Value
ar: القيمة
fr: Valeur

# order.empty_ticket_message
source: Tap an item to start the order
ar: المس صنفًا لبدء الطلب
fr: Touchez un article pour démarrer la commande

# order.empty_ticket_title %@
source: %@ empty
ar: %@ فارغة
fr: %@ vide

# order.exact_amount
source: Exact
ar: المبلغ بالضبط

# order.fire_suite_action
source: Next course
ar: الطبق التالي
fr: Suite

# order.floor_plan_label
source: Floor plan
ar: مخطط الصالة
fr: Plan de salle

# order.held_order_summary %lld %@ %@
source: %lld item(s) · ⁦%@⁩ · %@
ar: %lld صنف · ⁦%@⁩ · %@
fr: %lld article(s) · ⁦%@⁩ · %@

# order.held_orders_count %lld
source: %lld order(s)
ar: %lld طلب
fr: %lld commande(s)

# order.held_orders_title
source: Held orders
ar: الطلبات المعلّقة
fr: Commandes en attente

# order.held_queue_label %lld
source: Held orders: %lld
ar: الطلبات المعلّقة: %lld
fr: Commandes en attente : %lld

# order.hold_action
source: Hold
ar: تعليق
fr: Attente

# order.hold_label_placeholder
source: Customer name or reference
ar: اسم الزبون أو مرجعه
fr: Nom ou repère du client

# order.hold_sheet_subtitle
source: Frees the register for the next customer
ar: يُحرّر الصندوق للزبون التالي
fr: Libère la caisse pour le client suivant

# order.hold_sheet_title
source: Put on hold
ar: تعليق الطلب
fr: Mettre en attente

# order.in_kitchen_label
source: In kitchen
ar: في المطبخ
fr: En cuisine

# order.included_label
source: Included
ar: مشمول
fr: Inclus

# order.instead_of_price %@
source: (instead of ⁦%@⁩)
ar: (بدلًا من ⁦%@⁩)
fr: (au lieu de ⁦%@⁩)

# order.invalid_discount_value
source: Invalid discount value
ar: قيمة خصم غير صالحة
fr: Valeur de remise invalide

# order.kitchen_comment_label
source: Kitchen note
ar: ملاحظة للمطبخ
fr: Commentaire cuisine

# order.kitchen_comment_placeholder
source: E.g. no onions, allergy…
ar: مثال: بدون بصل، حساسية…
fr: Ex. sans oignons, allergie…

# order.max_options_error %lld %@
source: Maximum %lld option(s) for “%@”
ar: %lld خيار كحد أقصى لـ «%@»
fr: Maximum %lld option(s) pour « %@ »

# order.modifier_subtitle %@ %@
source: Base price ⁦%@⁩ · VAT %@%%
ar: السعر الأساسي ⁦%@⁩ · VAT %@%%
fr: Prix de base ⁦%@⁩ · TVA %@ %%

# order.no_held_orders_message
source: Use “Hold” to park a ticket.
ar: استخدم «تعليق» لتعليق تذكرة.
fr: Utilisez « Attente » pour parquer un ticket.

# order.no_held_orders_title
source: No held orders
ar: لا توجد طلبات معلّقة
fr: Aucune commande en attente

# order.not_sent_label
source: Not sent
ar: لم يُرسل
fr: Non envoyé

# order.options_total %@%@
source: Options %@⁦%@⁩
ar: الخيارات %@⁦%@⁩

# order.page_indicator %lld/%lld
source: Page %lld/%lld
ar: صفحة %lld/%lld

# order.pay_button %@
source: Pay ⁦%@⁩
ar: تحصيل ⁦%@⁩
fr: Encaisser ⁦%@⁩

# order.product_tile_hint_add
source: Adds to the ticket
ar: يُضيف إلى التذكرة
fr: Ajoute au ticket

# order.product_tile_hint_options
source: Opens the options
ar: يفتح الخيارات
fr: Ouvre les options

# order.product_tile_quantity_value %lld
source: %lld in the ticket
ar: %lld في التذكرة
fr: %lld au ticket

# order.quick_products
source: Quick
ar: سريع
fr: Rapide

# order.recall_button
source: Recall
ar: استرجاع
fr: Rappeler

# order.remaining_due_label
source: Remaining due
ar: المتبقي للدفع
fr: Reste à payer

# order.remove_discount_button
source: Remove discount
ar: حذف الخصم
fr: Supprimer la remise

# order.send_kitchen_button
source: Kitchen
ar: المطبخ
fr: Cuisine

# order.service_label
source: Course
ar: مرحلة التقديم
fr: Service

# order.subtotal_label
source: Subtotal
ar: المجموع الفرعي
fr: Sous-total

# order.supervisor_auth_title
source: Supervisor authorization
ar: تفويض المشرف
fr: Autorisation superviseur

# order.total_ht_label
source: Total excl. tax
ar: الإجمالي دون الضريبة
fr: Total HT

# order.total_ttc_label
source: Total incl. tax
ar: الإجمالي شامل الضريبة
fr: Total TTC

# order.transfer_action
source: Transfer
ar: نقل
fr: Transfert

# order.transfer_merge_button
source: Merge
ar: دمج
fr: Fusionner

# order.transfer_mode_label
source: Mode
ar: الوضع

# order.transfer_move_button
source: Transfer
ar: نقل
fr: Transférer

# order.transfer_option_merge
source: Merge (occupied table)
ar: دمج (طاولة مشغولة)
fr: Fusionner (table occupée)

# order.transfer_option_move
source: Transfer (free table)
ar: نقل (طاولة شاغرة)
fr: Transférer (table libre)

# order.transfer_sheet_subtitle
source: Choose the destination table
ar: اختر طاولة الوجهة
fr: Choisissez la table de destination

# order.transfer_sheet_title %@
source: Transfer %@
ar: نقل %@
fr: Transférer %@

# order.void_confirmation_subtitle %@
source: Cancelling “%@”
ar: إلغاء «%@»
fr: Annulation de « %@ »

# payment.available_credit %@
source: Available credit ⁦%@⁩
ar: الرصيد المتاح ⁦%@⁩
fr: Crédit disponible ⁦%@⁩

# payment.buzzer_label
source: Buzzer
ar: جهاز النداء

# payment.buzzer_placeholder
source: Buzzer/pager number (optional)
ar: رقم جهاز النداء (اختياري)
fr: N° de buzzer / bipeur (facultatif)

# payment.cash_tendered_label
source: Amount tendered
ar: المبلغ المدفوع
fr: Montant remis

# payment.change_due %@
source: Change ⁦%@⁩
ar: الباقي ⁦%@⁩
fr: Rendu ⁦%@⁩

# payment.change_due_title
source: Change due
ar: الباقي المستحق
fr: Rendu monnaie

# payment.change_to_give
source: Change to give
ar: الباقي المُعاد
fr: Monnaie à rendre

# payment.confirm_room_charge_button
source: Confirm the charge
ar: تأكيد التحميل
fr: Valider la facturation

# payment.continue_button
source: Continue checkout
ar: متابعة التحصيل
fr: Continuer l'encaissement

# payment.customer_signature_label
source: Customer signature
ar: توقيع الزبون
fr: Signature du client

# payment.finish_button
source: Finish
ar: إنهاء
fr: Terminer

# payment.guests_count %lld
source: %lld guests
ar: %lld ضيوف
fr: %lld convives

# payment.method_label
source: Payment method
ar: طريقة الدفع
fr: Moyen de paiement

# payment.next_customer_button
source: Next customer
ar: الزبون التالي
fr: Client suivant

# payment.pickup_number_label
source: Pickup number
ar: رقم الاستلام
fr: N° de retrait

# payment.print_not_queued
source: No printer available: nothing was printed
ar: لا توجد طابعة متاحة: لم تتم الطباعة
fr: Aucune imprimante disponible : rien n'a été imprimé

# payment.print_receipt
source: Print receipt
ar: طباعة الإيصال
fr: Imprimer le ticket de caisse

# payment.print_receipt_label
source: Print the receipt (AGEC law: on request)
ar: طباعة الإيصال (قانون AGEC: عند الطلب)
fr: Imprimer le ticket de caisse (loi AGEC : sur demande)

# payment.receipt_number %@
source: Receipt %@
ar: الإيصال %@
fr: Reçu %@

# payment.remaining_due %@
source: Remaining due: ⁦%@⁩
ar: المتبقي للدفع: ⁦%@⁩
fr: Reste à payer : ⁦%@⁩

# payment.result_paid
source: Payment confirmed
ar: تم تأكيد الدفع
fr: Paiement validé

# payment.result_partial
source: Partial payment recorded
ar: تم تسجيل دفع جزئي
fr: Paiement partiel enregistré

# payment.room_charge_label
source: Hotel room
ar: غرفة فندق
fr: Chambre d'hôtel

# payment.room_charge_title
source: Charge to a room
ar: التحميل على غرفة
fr: Facturer sur une chambre

# payment.room_charge_total %@
source: Total ⁦%@⁩
ar: الإجمالي ⁦%@⁩

# payment.room_option %@ %@
source: Room %@ — %@
ar: الغرفة %@ — %@
fr: Chambre %@ — %@

# payment.room_picker_label
source: Room
ar: الغرفة
fr: Chambre

# payment.sheet_title
source: Checkout
ar: التحصيل
fr: Encaissement

# payment.sign_here_label
source: Sign here
ar: وقّع هنا
fr: Signez ici

# payment.split_equal_parts
source: Split equally
ar: تقسيم بالتساوي
fr: Partager à parts égales

# payment.split_full_bill
source: Full bill
ar: الفاتورة كاملة
fr: Addition complète

# payment.split_mode_label
source: Mode
ar: الوضع

# payment.tip_custom_placeholder
source: Other €
ar: مبلغ آخر €
fr: Autre €

# payment.tip_included %@
source: including tip ⁦%@⁩
ar: منها بقشيش ⁦%@⁩
fr: dont pourboire ⁦%@⁩

# payment.tip_label
source: Tip
ar: بقشيش
fr: Pourboire

# payment.tip_none
source: None
ar: بدون
fr: Aucun

# payment.to_collect_label
source: To collect
ar: للتحصيل
fr: À encaisser

# payment.validate_method %@
source: Confirm %@
ar: تأكيد %@
fr: Valider %@

# payment.validate_with_change %@
source: Confirm · change ⁦%@⁩
ar: تأكيد · الباقي ⁦%@⁩
fr: Valider · rendu ⁦%@⁩

# payment.voucher_amount_validity %@
source: Amount ⁦%@⁩ · valid 90 days
ar: المبلغ ⁦%@⁩ · صالحة 90 يومًا
fr: Montant ⁦%@⁩ · valable 90 jours

# payment.voucher_face_value_label
source: Voucher face value
ar: القيمة الاسمية للقسيمة
fr: Valeur faciale du titre

# payment.voucher_issued_label
source: Customer voucher issued
ar: تم إصدار قسيمة رصيد للزبون
fr: Avoir client émis

# fiscal.verification_title
source: Chain integrity verification
ar: التحقق من سلامة السلاسل
fr: Contrôle d'intégrité des chaînes

# fiscal.verification_subtitle
source: Verifies SHA-256 cryptographic chaining of all receipts, Z and JET.
ar: يتحقق من التسلسل التشفيري SHA-256 لجميع الإيصالات وتقارير Z وسجل JET.
fr: Vérifie le chaînage cryptographique SHA-256 de tous les reçus, Z et JET.

# fiscal.verify_chains_button
source: Verify integrity
ar: التحقق من السلامة
fr: Vérifier l'intégrité

# admin.address_lines
source: Address (lines)
ar: العنوان
fr: Adresse (lignes)

# admin.certificate_number
source: NF525 certificate number
ar: رقم شهادة NF525
fr: Numéro de certificat NF525

# admin.company_name
source: Company name
ar: الاسم التجاري
fr: Raison sociale

# admin.establishment_subtitle
source: These mandatory NF525 details appear on receipts and closures.
ar: تظهر هذه البيانات الإلزامية لـ NF525 على الإيصالات والإغلاقات.
fr: Ces mentions obligatoires NF525 figurent sur les tickets et clôtures.

# admin.establishment_title
source: Establishment identity & fiscal year
ar: هوية المنشأة والسنة المالية
fr: Identité de l'établissement & exercice fiscal

# admin.fiscal_year_day
source: Start day (1-28)
ar: يوم البداية (1-28)
fr: Jour de début (1-28)

# admin.fiscal_year_month
source: Start month (1-12)
ar: شهر البداية (1-12)
fr: Mois de début (1-12)

# admin.fiscal_year_start
source: Fiscal year start
ar: بداية السنة المالية
fr: Début d'exercice fiscal

# admin.save_establishment
source: Save identity
ar: حفظ الهوية
fr: Enregistrer l'identité

# admin.section_establishment
source: Establishment & fiscal
ar: المنشأة والبيانات المالية
fr: Établissement & fiscal

# admin.siret
source: SIRET number (14 digits)
ar: رقم SIRET (14 رقمًا)
fr: Numéro SIRET (14 chiffres)

# admin.vat_number
source: VAT number
ar: رقم الضريبة على القيمة المضافة
fr: Numéro TVA intracommunautaire

# fiscal.cert_pending
source: NF525 pending
ar: شهادة NF525 قيد التنفيذ
fr: Certification NF525 en cours

# fiscal.period_closures_title
source: Period Closures
ar: إقفالات الفترات
fr: Clôtures de période

# fiscal.period_closures_subtitle
source: Cumulative sealed monthly and annual closures (NF525).
ar: إقفالات شهرية وسنوية تراكمية ومختومة NF525.
fr: Clôtures mensuelles et annuelles cumulatives scellées NF525.

# fiscal.period_type
source: Period type
ar: نوع الفترة
fr: Type de période

# fiscal.period_monthly
source: Monthly
ar: شهري
fr: Mensuelle

# fiscal.period_annual
source: Annual
ar: سنوي
fr: Annuelle

# fiscal.period_key
source: Period
ar: الفترة
fr: Période

# fiscal.execute_period_closure
source: Execute period closure
ar: إقفال الفترة
fr: Clôturer la période

# fiscal.period_history_title
source: Sealed closures history
ar: سجل الإقفالات المختومة
fr: Historique des clôtures scellées

# fiscal.duplicate_banner %@
source: DUPLICATE #%@
ar: نسخة طبق الأصل رقم %@
fr: DUPLICATA n°%@

# fiscal.reprint_receipt_title
source: Receipt Reprint
ar: إعادة طباعة الإيصال
fr: Réimpression de ticket

# fiscal.reprint_receipt_subtitle
source: Reprint a receipt with mandatory DUPLICATE notice.
ar: إعادة طباعة إيصال مع إشعار نسخة طبق الأصل.
fr: Réimprimer un reçu avec mention DUPLICATA obligatoire.

# fiscal.reprint_receipt_placeholder
source: Receipt # or UUID
ar: رقم الإيصال أو المعرف
fr: N° de reçu ou UUID

# fiscal.reprint_receipt_btn
source: Reprint
ar: إعادة طباعة
fr: Réimprimer

# fiscal.archives_title
source: Fiscal Archives (NF525)
ar: الأرشيفات المالية (NF525)
fr: Archives Fiscales (NF525)

# fiscal.archives_subtitle
source: Generation, retention and integrity verification of sealed archives.
ar: إنشاء وحفظ والتحقق من سلامة الأرشيفات المختومة.
fr: Génération, conservation et vérification d'intégrité des archives scellées.

# fiscal.action_archive
source: Archive
ar: أرشفة
fr: Archiver

# fiscal.archive_created_success
source: Archive generated and sealed successfully
ar: تم إنشاء الأرشيف وختمه بنجاح
fr: Archive générée et scellée avec succès

# fiscal.archive_valid
source: Valid and intact archive (unbroken chain)
ar: أرشيف صالح وسليم (السلسلة سليمة)
fr: Archive valide et intègre (chaîne intacte)

# fiscal.archive_hash_mismatch
source: Invalid SHA-256 hash: archive has been tampered with!
ar: بصمة SHA-256 غير صالحة: تم العبث بالأرشيف!
fr: Empreinte SHA-256 invalide : archive altérée !

# fiscal.archive_unknown
source: Unknown archive
ar: أرشيف غير معروف
fr: Archive inconnue du système

# fiscal.archive_chain_break
source: Chain break detected for this archive
ar: تم اكتشاف انقطاع في السلسلة لهذا الأرشيف
fr: Rupture de chaîne détectée pour cette archive

# fiscal.archive_forbidden
source: Archiving is reserved for managers
ar: الأرشفة مخصصة للمسؤولين فقط
fr: Archivage réservé aux responsables

# fiscal.archived
source: Archived
ar: مؤرشف
fr: Archivée

# mode.choice_title
source: How will this iPad be used?
ar: كيف سيُستخدم هذا الـ iPad؟
fr: Comment cet iPad sera-t-il utilisé ?

# mode.choice_subtitle
source: This choice is final unless the app is reinstalled.
ar: هذا الاختيار نهائي ما لم يُعاد تثبيت التطبيق.
fr: Ce choix est définitif tant que l'application n'est pas réinstallée.

# mode.server_title
source: Connected to a server
ar: متصل بخادم
fr: Relié à un serveur

# mode.server_detail
source: Pair this iPad with the restaurant's POS server.
ar: اقرن هذا الـ iPad بخادم نقطة البيع الخاص بالمطعم.
fr: Appairez cet iPad au serveur de caisse du restaurant.

# mode.standalone_title
source: Standalone iPad
ar: iPad مستقل
fr: iPad autonome

# mode.standalone_detail
source: Everything stays on this iPad, no server needed.
ar: كل شيء يبقى على هذا الـ iPad دون الحاجة إلى خادم.
fr: Tout reste sur cet iPad, sans serveur.

# mode.standalone_status
source: Standalone mode
ar: الوضع المستقل
fr: Mode autonome

# mode.non_fiscal_banner
source: Standalone mode, not fiscal: do not use for real sales yet.
ar: الوضع المستقل، غير ضريبي: لا تستخدمه للبيع الفعلي بعد.
fr: Mode autonome, non fiscal : ne pas encaisser en conditions réelles pour l'instant.

# startup.error_title
source: Cannot open the data
ar: تعذّر فتح البيانات
fr: Impossible d'ouvrir les données

# startup.retry
source: Try again
ar: إعادة المحاولة
fr: Réessayer

# admin.station_vat %@ %@
source: %@ · VAT %@%%
fr: %@ · TVA %@ %%

# admin.vat_label
source: VAT
fr: TVA

# fiscal.slip_vat_row %@
source: VAT %@ %%
fr: TVA %@ %%

# order.vat_rate_suffix %@
source: · VAT %@%%
fr: · TVA %@ %%

# order.vat_row_label %@
source: VAT %@ %%
fr: TVA %@ %%
